src/Catalogs/УчетныеЗаписиМаркетплейсов/УчетныеЗаписиМаркетплейсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчетныеЗаписиМаркетплейсов</name>
  <attributes>
    <name>ВидМаркетплейса</name>
    <type>
      <types>EnumRef.ВидыМаркетплейсов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникКатегории</name>
    <type>
      <types>EnumRef.ИсточникиКатегорийДляМаркетплейса</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаУчета</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ХешНастроек</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеОбновлятьДанныеТорговойПлощадки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <type>
      <types>CatalogRef.СоглашенияСКлиентами</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорПродажиЧерезСкладыТорговойПлощадки</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорПродажиЧерезСкладыСобственные</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторМагазина</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторАккаунта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СхемаРаботы</name>
    <type>
      <types>EnumRef.СхемыРаботыТорговыхПлощадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКабинета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВидыЦен</name>
    <attributes>
      <name>ИмяНастройки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеНастройки</name>
    <attributes>
      <name>ИдентификаторНастройки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеНастройки</name>
      <type>
        <types>Boolean</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеНастройкиСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеНастройкиСсылка</name>
      <comment>Состав типов реквизита дополняется по мере необходимости</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/ВидыМаркетплейсов/ВидыМаркетплейсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыМаркетплейсов</name>
  <enumValues>
    <name>МаркетплейсЯндексМаркет</name>
  </enumValues>
  <enumValues>
    <name>МаркетплейсOzon</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/УчетныеЗаписиМаркетплейсов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Процедура - обработчик события ПередЗаписью.
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.МаркетплейсOzon Тогда
		СтруктураНастроек = Новый Структура;
		СтруктураНастроек.Вставить("Организация", Организация);
		СтруктураНастроек.Вставить("ИдентификаторКлиента", ИдентификаторКлиента);
		СтруктураНастроек.Вставить("ИсточникКатегории", ИсточникКатегории);
		СтруктураНастроек.Вставить("ВалютаУчета", ВалютаУчета);
		СтруктураНастроек.Вставить("ВидыЦен", ВидыЦен.Выгрузить());
		
		ХешНастроек = Справочники.УчетныеЗаписиМаркетплейсов.ПолучитьХешНастроек(СтруктураНастроек);
	КонецЕсли;

	ИзменениеПометкиУдаления = 0;
	Если ПометкаУдаления = Истина И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПометкаУдаления") = Ложь Тогда // Помечается
		ИзменениеПометкиУдаления = 1;
	ИначеЕсли ПометкаУдаления = Ложь И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПометкаУдаления") = Истина Тогда // Снимается
		ИзменениеПометкиУдаления = -1;
	КонецЕсли;

	ДополнительныеСвойства.Вставить("ИзменениеПометкиУдаления", ИзменениеПометкиУдаления);
	ДополнительныеСвойства.Вставить("ПредставлениеСсылкиДоИзменения", Строка(Ссылка));

КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Если Отказ Или ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ИзменениеПометкиУдаления = 0;
	ДополнительныеСвойства.Свойство("ИзменениеПометкиУдаления", ИзменениеПометкиУдаления);

	Если ИзменениеПометкиУдаления = 1 Тогда	// Помечается
		Использование = Ложь;
	ИначеЕсли ИзменениеПометкиУдаления = -1 Тогда	// Снимается
		Использование = Истина;
	КонецЕсли;
	
	ПредставлениеСсылкиДоИзменения = "";
	ДополнительныеСвойства.Свойство("ПредставлениеСсылкиДоИзменения", ПредставлениеСсылкиДоИзменения);
	ИзмененоПредставление = (ПредставлениеСсылкиДоИзменения <> Строка(Ссылка));

	Идентификатор = Ссылка.УникальныйИдентификатор();
	МенеджерОбъекта = Справочники.УчетныеЗаписиМаркетплейсов;

	УстановитьПривилегированныйРежим(Истина);

	Если ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.МаркетплейсOzon Тогда
		Префиксы = ИнтеграцияСМаркетплейсомOzonКлиентСервер.ПрефиксыСервиса(Истина);

		Если ЗначениеЗаполнено(ИзменениеПометкиУдаления) Тогда
			Для Каждого Префикс Из Префиксы Цикл
				МенеджерОбъекта.УстановитьИспользованиеРегламентногоЗадания(Префикс.Значение + Идентификатор, Использование);
			КонецЦикла;
		КонецЕсли;

		Если ИзменениеПометкиУдаления = -1 Или ИзмененоПредставление Тогда
			Для Каждого Префикс Из Префиксы Цикл
				ПредставлениеРегламентногоЗадания = ИнтеграцияСМаркетплейсомOzonКлиентСервер.НаименованиеРегламентногоЗадания(Префикс.Значение);
				МенеджерОбъекта.УстановитьНаименованиеРегламентногоЗадания(Префикс.Значение + Идентификатор, ПредставлениеРегламентногоЗадания, Наименование);
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.МаркетплейсЯндексМаркет Тогда
		ДоступнаРаботаСОстатками = МенеджерОбъекта.ДоступнаРаботаСОстатками(ВидМаркетплейса, СхемаРаботы);
		Если НЕ ДоступнаРаботаСОстатками Тогда
			МенеджерОбъекта.УдалитьРегламентноеЗадание("ЯндексМаркет_ВыгрузкаОстатковТоваровЯндексМаркет_" + Идентификатор);
		КонецЕсли;

		Префиксы = ИнтеграцияСЯндексМаркетСервер.ПрефиксыРегламентныхЗаданий();

		Если ЗначениеЗаполнено(ИзменениеПометкиУдаления) Тогда
			Для Каждого Префикс Из Префиксы Цикл
				МенеджерОбъекта.УстановитьИспользованиеРегламентногоЗадания(Префикс.Значение + Идентификатор, Использование);
			КонецЦикла;
		КонецЕсли;

		Если ИзменениеПометкиУдаления = -1 Или ИзмененоПредставление Тогда
			Для Каждого Префикс Из Префиксы Цикл
				МенеджерОбъекта.УстановитьНаименованиеРегламентногоЗадания(Префикс.Значение + Идентификатор, Префикс.Представление, Строка(Ссылка));
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

Процедура ПередУдалением(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Идентификатор = Ссылка.УникальныйИдентификатор();
	МенеджерОбъекта = Справочники.УчетныеЗаписиМаркетплейсов;

	Если ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.МаркетплейсOzon Тогда
		Префиксы = ИнтеграцияСМаркетплейсомOzonКлиентСервер.ПрефиксыСервиса(Истина);
	ИначеЕсли ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.МаркетплейсЯндексМаркет Тогда
		Префиксы = ИнтеграцияСЯндексМаркетСервер.ПрефиксыРегламентныхЗаданий();
	Иначе
		Префиксы = Неопределено;
	КонецЕсли;

	Если Префиксы = Неопределено Тогда
		Для Каждого Префикс Из Префиксы Цикл
			МенеджерОбъекта.УдалитьРегламентноеЗадание(Префикс.Значение + Идентификатор);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
